In [54]:
! pip install pandas

Requirement already satisfied: pandas in c:\python310\lib\site-packages (1.4.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\python310\lib\site-packages (from pandas) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: You are using pip version 21.2.3; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Python310\python.exe -m pip install --upgrade pip' command.

In [55]:
import pandas as pd

# Series
Series is a one dimensional labelled array that can hold/stores data

In [56]:
book_title = [ 'C++', 'Java', 'Python', 'Javascript']
pd.Series(book_title)

0           C++
1          Java
2        Python
3    Javascript
dtype: object

In [57]:
type(book_title)

list

In [58]:
book_title=pd.Series(book_title)
type(book_title)

pandas.core.series.Series

In [59]:
#How To access using indexes :-
book_title[3]

'Javascript'

In [60]:
book_title= pd.Series(book_title, index= ['(i)','(ii)','(iii)','(iv)'])
book_title
#Here you will get error because, book_title is not a list any longer, it is now a 
#pandas Series, thats why that error.

(i)      NaN
(ii)     NaN
(iii)    NaN
(iv)     NaN
dtype: object

In [61]:
book_title2= ['C++','Java','Python','Javascript']
book_title2=pd.Series(book_title2,index=['(i)','(ii)','(iii)','(iv)'])
# OR
#book_title2=pd.Series(book_title2)
#book_title2.index= ['(i)','(ii)','(iii)','(iv)']
book_title2

(i)             C++
(ii)           Java
(iii)        Python
(iv)     Javascript
dtype: object

In [62]:
#This will give error
book_title2[(ii)]

NameError: name 'ii' is not defined

In [ ]:
book_title2['(ii)']

'Java'

# DataFrame :
2D labelled array rather than 1D labelled array "Series"

In [ ]:
import numpy as np

In [ ]:
np_arr3=np.random.randint(10,100, size=(6,4))
np_arr3

array([[52, 31, 61, 74],
       [60, 92, 87, 57],
       [58, 40, 23, 64],
       [93, 83, 12, 87],
       [76, 16, 67, 85],
       [59, 42, 68, 59]])

In [ ]:
df= pd.DataFrame(data = np_arr3)
df

    0   1   2   3
0  52  31  61  74
1  60  92  87  57
2  58  40  23  64
3  93  83  12  87
4  76  16  67  85
5  59  42  68  59

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df[3]

0    74
1    57
2    64
3    87
4    85
5    59
Name: 3, dtype: int32

In [ ]:
type(df[3])

pandas.core.series.Series

In [ ]:
#change column names:
df= pd.DataFrame(data = np_arr3, columns = ['A','B','C','D'])
df
#or : df.columns=['A','B','C','D']

    A   B   C   D
0  52  31  61  74
1  60  92  87  57
2  58  40  23  64
3  93  83  12  87
4  76  16  67  85
5  59  42  68  59

In [ ]:
df.shape

(6, 4)

In [ ]:
df.head(n=3)

    A   B   C   D
0  52  31  61  74
1  60  92  87  57
2  58  40  23  64

In [ ]:
df.tail(n=3)

    A   B   C   D
3  93  83  12  87
4  76  16  67  85
5  59  42  68  59

Extracting Columns :-

In [ ]:
df['C']

0    61
1    87
2    23
3    12
4    67
5    68
Name: C, dtype: int32

In [ ]:
df[['A','B']]

    A   B
0  52  31
1  60  92
2  58  40
3  93  83
4  76  16
5  59  42

In [ ]:
# Or :
cols= ['A','B']
df[cols]

    A   B
0  52  31
1  60  92
2  58  40
3  93  83
4  76  16
5  59  42

Add new columns

In [64]:
df['A+B']=df['A']+ df['B']
df

    A   B   C   D  A+B
0  52  31  61  74   83
1  60  92  87  57  152
2  58  40  23  64   98
3  93  83  12  87  176
4  76  16  67  85   92
5  59  42  68  59  101

In [65]:
df.drop(columns=['A+B'])

    A   B   C   D
0  52  31  61  74
1  60  92  87  57
2  58  40  23  64
3  93  83  12  87
4  76  16  67  85
5  59  42  68  59

But , still when you will print df it will print the dropped columns also because we have not updated df to the new dropped one.

i.e,
df= df.drop(columns=['A+B'])
But there is another way also :

df.drop(columns=['A+B'], inplace = True)

In [66]:
df

    A   B   C   D  A+B
0  52  31  61  74   83
1  60  92  87  57  152
2  58  40  23  64   98
3  93  83  12  87  176
4  76  16  67  85   92
5  59  42  68  59  101

# Indexing or Extracting data :

In [68]:
df.index = "p q r s t u".split()
df

    A   B   C   D  A+B
p  52  31  61  74   83
q  60  92  87  57  152
r  58  40  23  64   98
s  93  83  12  87  176
t  76  16  67  85   92
u  59  42  68  59  101

In [69]:
df.loc['q']

A       60
B       92
C       87
D       57
A+B    152
Name: q, dtype: int32

In [72]:
#But this gives the error :
#df.loc['q','r']

iloc = integer location, need not rely on given array indexing

In [73]:
df.iloc[0]

A      52
B      31
C      61
D      74
A+B    83
Name: p, dtype: int32

In [78]:
# extracting multiple rows:
df.iloc[2:5]

    A   B   C   D  A+B
r  58  40  23  64   98
s  93  83  12  87  176
t  76  16  67  85   92

In [81]:
df.iloc[2:-1][['A','B']]

    A   B
r  58  40
s  93  83
t  76  16

Masking and Boolean indexing :

In [82]:
df

    A   B   C   D  A+B
p  52  31  61  74   83
q  60  92  87  57  152
r  58  40  23  64   98
s  93  83  12  87  176
t  76  16  67  85   92
u  59  42  68  59  101

In [87]:
masked_df= df>35
masked_df

      A      B      C     D   A+B
p  True  False   True  True  True
q  True   True   True  True  True
r  True   True  False  True  True
s  True   True  False  True  True
t  True  False   True  True  True
u  True   True   True  True  True

In [89]:
# Error :- df(masked_df)
df[masked_df]

    A     B     C   D  A+B
p  52   NaN  61.0  74   83
q  60  92.0  87.0  57  152
r  58  40.0   NaN  64   98
s  93  83.0   NaN  87  176
t  76   NaN  67.0  85   92
u  59  42.0  68.0  59  101

In [90]:
df[df>35]

    A     B     C   D  A+B
p  52   NaN  61.0  74   83
q  60  92.0  87.0  57  152
r  58  40.0   NaN  64   98
s  93  83.0   NaN  87  176
t  76   NaN  67.0  85   92
u  59  42.0  68.0  59  101

In [95]:
new_mask = df['B'] > 35
new_mask

p    False
q     True
r     True
s     True
t    False
u     True
Name: B, dtype: bool

Now, Notice the below output and difference

In [96]:
df[new_mask]

    A   B   C   D  A+B
q  60  92  87  57  152
r  58  40  23  64   98
s  93  83  12  87  176
u  59  42  68  59  101

In [97]:
df[new_mask][['C','D']]

    C   D
q  87  57
r  23  64
s  12  87
u  68  59

In [98]:
df['A']>40

p    True
q    True
r    True
s    True
t    True
u    True
Name: A, dtype: bool

In [100]:
df['C']<50

p    False
q    False
r     True
s     True
t    False
u    False
Name: C, dtype: bool

In [102]:
(df['A']>40) & (df['C']<50)

p    False
q    False
r     True
s     True
t    False
u    False
dtype: bool

In [103]:
df [ (df['A']>40) & (df['C']<50) ]

    A   B   C   D  A+B
r  58  40  23  64   98
s  93  83  12  87  176

Convert df into a numpy array and vice-versa :

In [105]:
df_np_arr= df.values
df_np_arr

array([[ 52,  31,  61,  74,  83],
       [ 60,  92,  87,  57, 152],
       [ 58,  40,  23,  64,  98],
       [ 93,  83,  12,  87, 176],
       [ 76,  16,  67,  85,  92],
       [ 59,  42,  68,  59, 101]])

In [106]:
pd.DataFrame(df_np_arr)

    0   1   2   3    4
0  52  31  61  74   83
1  60  92  87  57  152
2  58  40  23  64   98
3  93  83  12  87  176
4  76  16  67  85   92
5  59  42  68  59  101

# Irish Dataset (Intro) :

In [120]:
pd.read_csv("./iris.csv")
#t is a dataframe

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [122]:
iris = pd.read_csv("./iris.csv")
type(iris)

pandas.core.frame.DataFrame

In [123]:
iris.head()
# By default it will show, only 5 rows 
# else you have to enter the number of rows as n= 7

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [124]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [125]:
iris.shape

(150, 5)

In [126]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

But, iris.rows gives an error

In [128]:
# Datatypes of each columns :
#strings are treated as objects heer
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [129]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [131]:
iris.describe()
#it describes many thngs about columns

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [132]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [133]:
iris['species'].nunique()

3

In [135]:
iris['species'].unique()
# This are the different unique species

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [138]:
#How many setosa flowers are there :
iris['species']=='setosa'

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: species, Length: 150, dtype: bool

In [139]:
#This will give you details about only 'setosa' species
#plants because of masking.
iris[ iris['species'] == 'setosa']

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.1  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.1           1.5          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [140]:
iris[ iris['species']=='setosa' ].shape

(50, 5)

In [141]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [142]:
iris['species'].value_counts()['virginica']

50

In [144]:
iris['petal_width'].mean()

1.1986666666666668

In [145]:
iris.sort_values(by= "sepal_length")

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In the above sorting, we can see that sepal_length of many are asame so , you can choose the criteria of sorting also that when the sorting criteria is same then do this. (by giving another arguements)

In [147]:
iris.sort_values(by=["sepal_length","sepal_width"])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]